'''
Χρήστος Διαμαντής, Π16168
Εισαγωγή στην επιστήμη των υπολογιστών
Εργασία 8/2017
Python 3,6

Άσκηση 2
Εργάζεστε σε μια εταιρεία που αναλύει την κυκλοφορία σε μια συγκεκριμένη διασταύρωση κατά τις ώρες αιχμής
από τις 4:00 μ.μ. έως τις 8:00 μ.μ. Κάθε μέρα, σας δίνεται μια λίστα που περιέχει τον αριθμό των οχημάτων
που περνούν από τη διασταύρωση κάθε 10 λεπτά από τις 4:00 έως τις 8:00 μ.μ.
Αναμένεται να επιστρέψετε μια λίστα πλειάδων που περιέχουν την ώρα και το μέγιστο ποσό κυκλοφορίας για
κάθε ώρα.
Παράδειγμα για είσοδο:
[23,24,34,45,43,23,57,34,65,12,19,45, 54,65,54,43,89,48,42,55,22,69,23,93]
ΕπιστÏ �έφετε:
[('4:00pm', 45), ('5:00pm', 65), ('6:00pm', 89), ('7:00pm', 93)]
'''
lista=input("Λίστα: ")
cList=''
for i in lista:
    if i.isdigit() or i==',':
        cList=cList+i

lList=cList.split(',')
tplLista=[]
for i in range(0,4):
   tplLista.append(tuple(['{}:00pm'.format(i+4),int(max(lList[1+i*6:6+i*6]))]))

print(tplLista)
  








